import pandas as pd

# Путь к файлам регионов с данными
REGION_PATH = {
    "vo": "regions/МС_Владимирская область.xls",  # Владимирская область
    "ko": "regions/МС_Кировская область.xls",  # Кировская область
    "no": "regions/МС_Нижегородская область.xls",  # Нижегородская область
    "rme": "regions/МС_Республика Марий Эл.xls",  # Республика Марий Эл
    "rm": "regions/МС_Республика Мордовия.xls",  # Республика Мордовия
    "rt": "regions/МС_Республика Татарстан.xls",  # Республика Татарстан
    "ru": "regions/МС_Республика Удмуртия.xls",  # Республика Удмуртия
    "rch": "regions/МС_Республика Чувашия.xls",  # Республика Чувашия
}

# Сопоставление кодов регионов с их названиями
REGION_CODE = {
    "vo": "Владимирская область",
    "ko": "Кировская область",
    "no": "Нижегородская область",
    "rme": "Республика Марий Эл",
    "rm": "Республика Мордовия",
    "rt": "Республика Татарстан",
    "ru": "Республика Удмуртия",
    "rch": "Республика Чувашия",
}


def get_region_df(region: str) -> pd.DataFrame:
    """
    Функция для загрузки данных о регионе из Excel файла.

    :param region: Код региона (например, 'vo', 'ko' и т.д.)
    :return: DataFrame с данными региона
    """
    # Чтение Excel файла по указанному коду региона
    return pd.read_excel(REGION_PATH[region])
